#include <iostream>
#include <locale>
#include <tchar.h>

int _tmain(int argc, _TCHAR* argv[])
{
   unsigned int k; // страниц в день
   unsigned int n; // страниц осталось прочитать
   // Установка русской локали для терминала Windows 11
   system("chcp 1251 >nul");// 1-й способ. Выплнить внешнюю команду.
   // 2 - й способ. Вызов библиотечной функции.
   setlocale(LC_ALL, "russian.1251");
   // 3 - й способ. Создать переменную типа локали
   std::locale rus_locale = std::locale("russian.1251");
   // 3 - й способ. Выбор кодировки(локали) терминала
   std::cout.imbue(std::locale::global(rus_locale));
   /*Ввод значений переменных с клавиатуры*/
   std::cout << "Сколько страниц будете читать в день? ";
   // Преобразование введённой строки в целое число
   std::cin >> k; // страниц в день
   std::cout << "Сколько страниц осталось прочитать? ";
   std::cin >> n; // осталось прочитать
   // Количество дней, на которое хватит книги
   unsigned int d = (n + k - 1) / k;
   // -- Вывод информации на экран --
   std::cout << "Этой книги вам хватит ещё на " << d << " дня(ей).\r\n";
   // -- Задержка вывода на экран до нажатия клавиши "Ввод"
   std::cin.ignore(); // Очистка буффера ввода
   std::cin.get(); // Считывание символа с клавиатуры
   return 0; // Выход из программы (функции)
}
